laminarVortexShedding/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30;
        startFace       38410;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       38440;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       38490;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       38570;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       38650;
    }
    sides
    {
        type            empty;
        inGroups        1(empty);
        nFaces          38600;
        startFace       38790;
    }
)

// ************************************************************************* //
